<%@ page contentType="text/html;charset=UTF-8"%>

<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN" "http://www.w3.org/TR/html4/loose.dtd">
<html>
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
<title>勞工退休金月提繳工資分級表</title>
<style type="text/css">
<!--
@import url(../css/styles.css);
-->
</style>
</head>

<body leftmargin="20">
<%    
int amount = request.getParameter("amount")!=null&&!request.getParameter("amount").equals("")?Integer.parseInt(request.getParameter("amount")):-100;
	String[][] grade={{"5","第1組" ,"1","1,500元以下 ","1,500元 ", "0", "1500"},
			{"", "第1組" ,"2","1,501元至3,000元 ","3,000元 ", "1501", "3000"},
			{"","第1組" ,"3","3,001元至4,500元 ","4,500元 ", "3001", "4500"},
			{"","第1組" ,"4","4,501元至6,000元 ","6,000元 ", "4501", "6000"},
			{"","第1組" ,"5","6,001元至7,500元 ","7,500元 ", "6001", "7500"},
			{"5","第2組" ,"6","7,501元至8,700元 ","8,700元 ", "7501", "8700"},
			{"","第2組" ,"7","8,701元至9,900元 ","9,900元 ", "8701", "9900"},
			{"","第2組" ,"8","9,901元至11,100元 ","11,100元 ", "9901", "11100"},
			{"","第2組" ,"9","11,101元至12,540元","12,540元", "11101", "12540"},
			{"","第2組","10","12,541元至13,500元 ","13,500元 ", "12541", "13500"},
			{"9","第3組","11","13,501元至15,840元 ","15,840元 ", "13501", "15840"},
			{"","第3組","12","15,841元至16,500元 ","16,500元 ", "15841", "16500"},
			{"","第3組","13","16,501元至17,280元","17,280元", "16501", "17280"},
			{"","第3組","14","17,281元至17,880元 ","17,880元 ", "17281", "17880"},
			{"","第3組","15","17,881元至19,047元 ","19,047元 ", "17881", "19047"},
			{"","第3組","16","19,048元至20,008元 ","20,008元 ", "19048", "20008"},
			{"","第3組","17","20,009元至21,009元 ","21,009元 ", "20009", "21009"},
			{"","第3組","18","21,010元至22,000元 ","22,000元 ", "21010", "22000"},
			{"","第3組","19","22,001元至22,800元 ","22,800元 ", "22001", "22800"},
			{"5","第4組","20","22,801元至24,000元 ","24,000元 ", "22801", "24000"},
			{"","第4組","21","24,001元至25,200元 ","25,200元 ", "24001", "25200"},
			{"","第4組","22","25,201元至26,400元 ","26,400元 ", "25201", "26400"},
			{"","第4組","23","26,401元至27,600元 ","27,600元 ", "26401", "27600"},
			{"","第4組","24","27,601元至28,800元 ","28,800元 ", "27601", "28800"},
			{"5","第5組","25","28,801元至30,300元 ","30,300元 ", "28801", "30300"},
			{"","第5組","26","30,301元至31,800元 ","31,800元 ", "30301", "31800"},
			{"","第5組","27","31,801元至33,300元 ","33,300元 ", "31801", "33300"},
			{"","第5組","28","33,301元至34,800元 ","34,800元 ", "33301", "34800"},
			{"","第5組","29","34,801元至36,300元 ","36,300元 ", "34801", "36300"},
			{"5","第6組","30","36,301元至38,200元 ","38,200元 ", "36301", "38200"},
			{"","第6組","31","38,201元至40,100元 ","40,100元 ", "38201", "40100"},
			{"","第6組","32","40,101元至42,000元 ","42,000元 ", "40101", "42000"},
			{"","第6組" ,"33","42,001元至43,900元 ","43,900元 ", "42001", "43900"},
			{"","第6組","34","43,901元至45,800元 ","45,800元 ", "43901", "45800"},
			{"5","第7組","35","45,801元至48,200元 ","48,200元 ", "45801", "48200"},
			{"","第7組","36","48,201元至50,600元 ","50,600元 ", "48201", "50600"},
			{"","第7組","37","50,601元至53,000元 ","53,000元 ", "50601", "53000"},
			{"","第7組","38","53,001元至55,400元 ","55,400元 ", "53001", "55400"},
			{"","第7組","39","55,401元至57,800元 ","57,800元 ", "55401", "57800"},
			{"5","第8組","40","57,801元至60,800元 ","60,800元 ", "57801", "60800"},
			{"","第8組","41","60,801元至63,800元 ","63,800元 ", "60801", "63800"},
			{"","第8組","42","63,801元至66,800元 ","66,800元 ", "63801", "66800"},
			{"","第8組","43","66,801元至69,800元 ","69,800元 ", "66801", "69800"},
			{"","第8組","44","69,801元至72,800元 ","72,800元 ", "69801", "72800"},
			{"4","第9組","45","72,801元至76,500元 ","76,500元 ", "72801", "76500"},
			{"","第9組","46","76,501元至80,200元 ","80,200元 ", "76501", "80200"},
			{"","第9組","47","80,201元至83,900元 ","83,900元 ", "80201", "83900"},
			{"","第9組","48","83,901元至87,600元 ","87,600元 ", "83901", "87600"},
			{"5","第10組","49","87,601元至92,100元 ","92,100元 ", "87601", "92100"},
			{"","第10組","50","92,101元至96,600元 ","96,600元 ", "92101", "96600"},
			{"","第10組","51","96,601元至101,100元 ","101,100元 ", "96601", "101100"},
			{"","第10組","52","101,101元至105,600元 ","105,600元 ", "101101", "105600"},
			{"","第10組","53","105,601元至110,100元 ","110,100元 ", "105601", "110100"},
			{"8","第11組","54","110,101元至115,500元 ","115,500元 ", "110101", "115500"},
			{"","第11組","55","115,501元至120,900元 ","120,900元 ", "115501", "120900"},
			{"","第11組","56","120,901元至126,300元 ","126,300元 ", "120901", "126300"},
			{"","第11組","57","126,301元至131,700元 ","131,700元 ", "126301", "131700"},
			{"","第11組","58","131,701元至137,100元 ","137,100元 ", "131701", "137100"},
			{"","第11組","59","137,101元至142,500元 ","142,500元 ", "137101", "142500"},
			{"","第11組","60","142,501元至147,900元 ","147,900元 ", "142501", "147900"},
			{"","第11組","61","147,901元以上 ","150,000元", "147901", "1000000"}};
	%>
  <table class=FormBorder width="100%"  border="0" cellpadding="0" cellspacing="0">
    <tr><td colspan=7> 
      <TABLE cellSpacing=0 cellPadding=0 width="100%" border=0>
        <TBODY>
          <tr>
            <td height="30" class=moduleTitle valign="bottom">勞工退休金月提繳工資分級表</td>
          </tr>
          <TR><TD>
            <DIV class=hline><IMG height=1 src="../images/blank.gif"></DIV>
          </TD></TR>
      </TBODY></TABLE><BR>
    </td></tr>
    <tr>
      <td colspan="7" class="background_left_menu"><div align="right">
        <table width="100%"  border="0" cellpadding="0" cellspacing="0">
          <TR><TD class=blackLine colSpan=9 height=1><IMG src="../images/blank.gif"></TD></TR>
          <tr class=moduleListTitle height="25">
          	<TD class=blackLine width=1><IMG src="../images/blank.gif"></TD>
            <td><div align="center">級距</div></td> 
            <TD class=blackLine width=1><IMG src="../images/blank.gif"></TD>
            <td><div align="center">級</div></td>
            <TD class=blackLine width=1><IMG src="../images/blank.gif"></TD>
            <td><div align="center">實際工資</div></td>
            <TD class=blackLine width=1><IMG src="../images/blank.gif"></TD>
            <td><div align="center">月提繳工資</div></td>
            <TD class=blackLine width=1><IMG src="../images/blank.gif"></TD>
          </tr>          
          <% for (int i=0; i<grade.length; i++) { %>
	          <% if (!grade[i][0].equals("")) { %>
	          	<TR><TD class=blackLine colSpan=9 height=1><IMG src="../images/blank.gif"></TD></TR>
	          <%} %>
	          <tr height="25">   
	            <% if (!grade[i][0].equals("")) { %>
	            	<TD class=blackLine width=1 rowspan=<%=grade[i][0]%>><IMG src="../images/blank.gif"></TD>
	            	<td rowspan=<%=grade[i][0]%>><div align="center"><%=grade[i][1]%></div></td>
	            	<TD class=blackLine width=1 rowspan=<%=grade[i][0]%>><IMG src="../images/blank.gif"></TD>
	            <%} %>
	            <td <%=amount>=Integer.parseInt(grade[i][5])&& amount<=Integer.parseInt(grade[i][6])?"bgcolor=#FF6666":""%>><div align="center"><%=grade[i][2]%></div></td>
	            <TD class=blackLine width=1><IMG src="../images/blank.gif"></TD>
	            <td <%=amount>=Integer.parseInt(grade[i][5])&& amount<=Integer.parseInt(grade[i][6])?"bgcolor=#FF6666":""%>><div align="center"><%=grade[i][3]%></div></td>
	            <TD class=blackLine width=1><IMG src="../images/blank.gif"></TD>
	            <td <%=amount>=Integer.parseInt(grade[i][5])&& amount<=Integer.parseInt(grade[i][6])?"bgcolor=#FF6666":""%>><div align="center"><%=grade[i][4]%></div></td>
	            <TD class=blackLine width=1><IMG src="../images/blank.gif"></TD>
	          </TR>
          <% } %>         
          <TR><TD class=blackLine colSpan=9 height=1><IMG src="../images/blank.gif"></TD></TR>
        </table>
      </td>
    </tr>
  </table>
</body>
</html>
